teddokano/shasta_demo_prototypes/_r01lib_frdm_mcxn947/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe1 0x01u        /*!<@brief Input Buffer Enable: Enables */
#define PORT5_PCR_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT1_8 (coord A1), P1_8/J9[32]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*! @name PORT1_9 (coord B1), P1_9/J9[30]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*! @name PORT1_2 (coord C4), ARD_D6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D6_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D6_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D6_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D6_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D6_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D6_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT0_14 (coord E11), ARD_A2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_A2_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_A2_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_A2_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_A2_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_A2_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_A2_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT0_22 (coord B8), ARD_A3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_A3_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_A3_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_A3_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_A3_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_A3_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_A3_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT0_15 (coord G13), ARD_A4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_A4_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_A4_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_A4_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_A4_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_A4_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_A4_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT0_23 (coord B7), ARD_A5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_A5_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_A5_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_A5_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_A5_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_A5_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_A5_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

