teddokano/shasta_demo_prototypes/_r01lib_frdm_mcxn947/board/pin_mux.h
/*! @name PORT4_3 (coord U1), ARD_D0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D0_GPIO GPIO4               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D0_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D0_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D0_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D0_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D0_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT4_2 (coord T1), ARD_D1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D1_GPIO GPIO4               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D1_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D1_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D1_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D1_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D1_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT0_29 (coord F8), ARD_D2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D2_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D2_GPIO_PIN 29U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D2_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D2_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D2_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D2_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT1_23 (coord M4), ARD_D3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D3_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D3_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D3_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D3_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D3_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D3_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT0_30 (coord E7), ARD_D4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D4_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D4_GPIO_PIN 30U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D4_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D4_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D4_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D4_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT1_21 (coord L5), ARD_D5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D5_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D5_GPIO_PIN 21U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D5_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D5_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D5_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D5_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT0_31 (coord D7), ARD_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D7_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D7_GPIO_PIN 31U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D7_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D7_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D7_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D7_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT0_28 (coord E8), ARD_D8
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D8_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D8_GPIO_PIN 28U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D8_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_ARD_D8_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_ARD_D8_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_ARD_D8_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

